In [1]:
import pandas as pd

In [3]:
df_exams = pd.read_csv("StudentsPerformance.csv")
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1 Seleccionar dos o más columnas

In [4]:
# usando [[]] para seleccionar dos o mas columnas. para eso pongo las dos columnas en los [ de adentro y entre comillas]

df_exams[["gender", "math score"]]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [8]:
# para ver si realmente es una DataFrame, escribo type y() la dataframe y columnas
type(df_exams[["gender", "math score"]])

pandas.core.frame.DataFrame

In [10]:
#seleccionar 2 o mas columnas con [[]] .Puedo cambiar el orden en el que quiero que aparezcan las columnas
df_exams[["reading score", "writing score", "math score", "gender"]]

     reading score  writing score  math score  gender
0               72             74          72  female
1               90             88          69  female
2               95             93          90  female
3               57             44          47    male
4               78             75          76    male
..             ...            ...         ...     ...
995             99             95          88  female
996             55             55          62    male
997             71             65          59  female
998             78             77          68  female
999             86             86          77  female

[1000 rows x 4 columns]

In [11]:
# no se puede seleccionar dos o más columnas con el "." punto y separando con comas, por eso conviene usar los brakets 
# dobles
df_exams."gender", "maths core"

SyntaxError: invalid syntax (2885327145.py, line 2)